backend/load-tests/mixed-load.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 300
      arrivalRate: 20
      rampTo: 100
      name: "Gradual ramp up"
    - duration: 180
      arrivalRate: 100
      name: "Peak load"
    - duration: 120
      arrivalRate: 100
      rampTo: 20
      name: "Ramp down"
  processor: "./load-tests/processors.js"

scenarios:
  - name: "Read Operations"
    weight: 40
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@test.com"
            password: "password123"
          capture:
            - json: "$.data.token"
              as: "authToken"
      - loop:
        - get:
            url: "/api/credits?page={{ $randomNumber(1, 5) }}&limit=10"
            headers:
              Authorization: "Bearer {{ authToken }}"
        - get:
            url: "/api/clients?page=1&limit=10"
            headers:
              Authorization: "Bearer {{ authToken }}"
        - get:
            url: "/api/analytics/overview"
            headers:
              Authorization: "Bearer {{ authToken }}"
        count: 3
        
  - name: "Write Operations"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@test.com"
            password: "password123"
          capture:
            - json: "$.data.token"
              as: "authToken"
      - function: "generateCreditData"
      - post:
          url: "/api/credits"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            amount: "{{ amount }}"
            term: "{{ term }}"
            purpose: "{{ purpose }}"
            
  - name: "Complex Queries"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@test.com"
            password: "password123"
          capture:
            - json: "$.data.token"
              as: "authToken"
      - get:
          url: "/api/analytics/credits-by-status"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - get:
          url: "/api/analytics/overdue-credits"
          headers:
            Authorization: "Bearer {{ authToken }}"
            
  - name: "Authentication Flow"
    weight: 10
    flow:
      - function: "generateRandomUser"
      - post:
          url: "/api/auth/register"
          json:
            name: "{{ name }}"
            email: "{{ email }}"
            phone: "{{ phone }}"
            password: "password123"
            identityDocument: "{{ identityDocument }}"
            dateOfBirth: "1990-01-01"
            address: "Test Address"
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "password123"